## 🤖 Atlantis Plan Output (Simulated)

```hcl
Terraform will perform the following actions:

  # aws_security_group.web will be created
  + resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers"
      + id                     = (known after apply)
      + name_prefix            = "dev-web-"
      + vpc_id                 = "vpc-0123456789abcdef0"

      + ingress {
          + cidr_blocks      = ["0.0.0.0/0"]
          + description      = "HTTP"
          + from_port        = 80
          + protocol         = "tcp"
          + to_port          = 80
        }
      + ingress {
          + cidr_blocks      = ["0.0.0.0/0"]
          + description      = "HTTPS"
          + from_port        = 443
          + protocol         = "tcp"
          + to_port          = 443
        }
      + ingress {
          + cidr_blocks      = ["10.0.0.0/16"]  # ✅ VPC ONLY - SECURE!
          + description      = "SSH"
          + from_port        = 22
          + protocol         = "tcp"
          + to_port          = 22
        }
    }

  # aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for database servers"
      + id                     = (known after apply)
      + name_prefix            = "dev-db-"
      + vpc_id                 = "vpc-0123456789abcdef0"

      + ingress {
          + description      = "MySQL/Aurora"
          + from_port        = 3306
          + protocol         = "tcp"
          + security_groups  = ["sg-web-reference"]  # ✅ WEB TIER ONLY - SECURE!
          + to_port          = 3306
        }
      + ingress {
          + description      = "PostgreSQL"
          + from_port        = 5432
          + protocol         = "tcp"
          + security_groups  = ["sg-web-reference"]  # ✅ WEB TIER ONLY - SECURE!
          + to_port          = 5432
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + database_security_group_id = (known after apply)
  + web_security_group_id      = (known after apply)
```

## 🔒 Security Analysis
✅ **SSH Access**: Restricted to VPC CIDR only (10.0.0.0/16)  
✅ **Database Access**: Only from web security group (defense in depth)  
✅ **Network Segmentation**: Proper tier isolation implemented  
✅ **No Public Database**: Database ports not exposed to internet  

## ⚠️ Review Required
This plan creates secure network infrastructure. **Manual approval required** before applying.

**To apply these changes after approval, comment:** `atlantis apply`